---
kind: type
id: T:Autodesk.Revit.DB.GradientBackgroundSettings
source: html/eccbccb0-a1ba-4319-2b2e-8f0e7343797f.htm
---
# Autodesk.Revit.DB.GradientBackgroundSettings

Represents the view gradient background settings.

## Syntax (C#)
```csharp
public class GradientBackgroundSettings : BackgroundSettings
```

## Remarks
The colors of the background are interpolated for the pixels
 corresponding to the sky - from the "sky color" (top) to the "horizon
 color" (bottom). The ground is represented with a solid color ("ground color").